[
  {
    "id": 1,
    "title": "Bridgeport™ Steel",
    "description": "There's a reason so many homeowners choose the Bridgeport™ Steel door: it captures that classic, handcrafted look and offers durable steel you can count on. Inspired by traditional stile and rail designs, the Bridgeport™ brings clean, recessed panels and precise symmetry to your garage without any of the fuss.\n\nChoose from wide or narrow panel styles, a huge range of colors (including wood-look finishes so real you'll do a double-take), and plenty of window and hardware options to make it yours. Underneath, Clopay's Intellicore® insulation means your garage stays quieter, warmer, and just plain tougher. It's a door built to stand up to every season, with low-maintenance finishes and smooth, reliable operation day in and day out. Bridgeport™ Steel is proof that you really can have curb appeal, durability, and minimal upkeep, all in one smart upgrade.",
    "images": ["/images/bridgeport/door1.png", "", "", "", "", "", "", ""]
  },
  {
    "id": 2,
    "title": "Canyon Ridge® Elements",
    "description": "Introducing Canyon Ridge® Elements—the introductory model in our top-selling line of faux-wood carriage house garage doors. This collection blends the inviting look of classic painted wood with the staying power of modern materials, offering a style that feels both familiar and fresh. Each door features moisture-resistant composite overlays with clean, square “Shaker” edges set over insulated steel, so you get the warmth and dimension of wood without the stress of upkeep or worries about weather.\n\nYou’ll see the difference right away: these doors elevate your home’s curb appeal with crisp lines and a beautifully textured surface. The insulated steel core keeps your garage comfortable and quiet, while the low-maintenance finish means you can enjoy the look for years with minimal effort. Choose from 13 versatile designs in seven finishes, including bold shades like Charcoal, Black, and Bronze, to find a style that fits your home. With Canyon Ridge® Elements, you get the charm of wood, the strength of steel, and a look that’s always easy to live with.",
    "images": ["", "", "", "", "", "", "", ""]
  },
  {
    "id": 3,
    "title": "Canyon Ridge® Chevron",
    "description": "The chevron pattern has long been a standout in textiles and flooring, and now it brings its unmistakable style to your garage with the Canyon Ridge® Chevron door. This door transforms the classic chevron pattern into an impressive design feature for your home, crafted from a low-maintenance composite that captures the look and feel of real wood, but without the risk of rot, warping, or cracking.\n\nChoose from four unique chevron patterns to give your garage its own look. Built to resist moisture and the elements, these doors keep their beauty season after season and don’t require a lot of upkeep. You can finish your door in a variety of stain or paint options, making it easy to customize for jaw-dropping good looks that are truly your own. With Canyon Ridge® Chevron, you get a cool design, lasting performance, and a door that always stands out.",
    "images": ["", "", "", "", "", "", "", ""]
  },
  {
    "id": 4,
    "title": "Canyon Ridge® Carriage House (5-Layer)",
    "description": "If you want a garage door that genuinely elevates your home’s appearance instead of just blending into the background, take a look at the Canyon Ridge® Carriage House (5-Layer). It’s got the unmistakable feel of wood, right down to the grain and texture, but it’s actually built with a tough insulated steel core. You get all the warmth and curb appeal of real wood, minus the constant upkeep and worry about rot, warping, or termites.\n\nThe Canyon Ridge® Carriage House (5-Layer) transforms the look of a home. The composite overlay is molded from real wood boards, so it truly looks authentic and handcrafted. Plus, you can pick a paint or stain that you love or even go for a custom color. The insulation keeps your garage comfortable year-round, and the design delivers timeless carriage house style with just the right amount of drama.\n\nIn short: this is a beautiful, durable garage door that transforms your garage into a true focal point of your home. Expect plenty of compliments from visitors and neighbors alike.",
    "images": ["", "", "", "", "", "", "", ""]
  },
  {
    "id": 5,
    "title": "Canyon Ridge® Carriage House (4-Layer)",
    "description": "The Canyon Ridge® Carriage House (4-Layer) door is another smart, stylish alternative to real wood—perfect for homeowners who want classic carriage house charm with none of the maintenance worries. Built with an energy-efficient Intellicore® polyurethane insulated steel core, this door is topped with moisture-resistant Clear Cypress composite overlays, capturing the rich texture of wood while standing strong against the elements. Unlike traditional wood, the composite overlay won’t warp, crack, or need constant touch ups, so it stays beautiful year after year.\n\nThis door has fully visible steel panels beneath the overlay, which you can finish in Ultra-Grain® for a stained wood look or paint in any color to match your home. The result is a versatile, low-maintenance garage door with all the warmth and character of wood, plus the added bonus of improved energy efficiency and durability. Whether you’re refreshing a historic home or just want a charming garage door, the Canyon Ridge® (4-Layer) makes it easy to get the look you love.",
    "images": ["", "", "", "", "", "", "", ""]
  },
  {
    "id": 6,
    "title": "Canyon Ridge® Louver",
    "description": "The Canyon Ridge® Louver garage door is all about bringing fresh, coastal-inspired style to your home no matter where you live. Designed with horizontal slats that imitate classic plantation shutters, this door instantly adds character and charm to everything from beach cottages to Colonial homes. It’s a look that feels breezy and relaxed yet refined. You get the warmth and texture of real wood, thanks to Clopay’s innovative faux wood composite construction, but without the constant upkeep or worry about the elements.\n\nThe Louver design is versatile enough to make a statement on a traditional exterior, or to give a modern farmhouse that extra bit of curb appeal. With customizable options for color, hardware, and windows, you can tailor the look to fit your personal style. If you’re looking for something that stands out from the typical garage door and really elevates your home’s facade, the Canyon Ridge® Louver delivers.",
    "images": ["", "", "", "", "", "", "", ""]
  },
  {
    "id": 7,
    "title": "Canyon Ridge® Modern",
    "description": "The Canyon Ridge® Modern makes a statement. It’s an eye-catching design for homes that crave clean lines and modern style. Crafted to mimic the warmth and character of real wood, these doors feature striking faux wood textures that look like the real thing whether you’re standing right next to them or seeing them from the curb. With their wide, horizontal planks and sleek, minimalist profiles, they’re a natural fit for mid-century modern homes, contemporary builds, or any space that leans into uncluttered architecture.\n\nEach door can be customized with narrow windows and metallic accents, letting in natural light while keeping the look sharp and sophisticated. Unlike traditional wood doors, Canyon Ridge® Modern doors offer the charm of wood without the upkeep, so you get lasting beauty with little maintenance. If you want a garage door that enhances your home’s curb appeal and stands out for all the right reasons, this is the one to beat.",
    "images": ["", "", "", "", "", "", "", ""]
  },
  {
    "id": 8,
    "title": "Modern Steel™",
    "description": "Forget everything you thought you knew about garage doors. The Modern Steel™ collection is for people who want their home’s style to hit you before you even step inside. With its precise lines, distinct flush or grooved panels, and a lineup of finishes that includes everything from ultra-sleek matte black to woodgrain looks so convincing, you might just catch people slowing down to stare.\n\nCustomize every detail: pick your color, texture, even the glass and window shape. Go minimalist with a solid panel, or add a stack of slim, contemporary windows for that mid-century vibe. And this isn’t just about looks—thanks to Clopay’s Intellicore® insulation, your garage stays comfortable, quiet, and energy-efficient, season after season. Plus, the steel is tough enough to handle life’s bumps and scrapes without losing its edge. If you’re ready to take your home from ordinary to unforgettable, consider the Modern Steel™.",
    "images": ["", "", "", "", "", "", "", ""]
  },
  {
    "id": 9,
    "title": "Modern Steel™ Ultra-Grain® Plank",
    "description": "The Modern Steel™ Ultra-Grain® Plank garage door is what happens when you throw out the old rules and mix things up. On one hand, it’s got that clean, streamlined look that fits right in with today’s modern architecture. On the other, its wood-look finish brings in the warmth, texture, and character you’d expect from a classic, hand-built door. You get the best of both worlds—a style contradiction that feels just right.\n\nThe horizontal planks are digitally printed to mimic real wood, with no repeating grain pattern, so every panel feels unique. The flush steel panels have subtle embossed stucco texture and deep, convincing grain. Up close, most people can’t tell it’s not the real thing. You can go rustic with finishes like Barnwood, Cedar, or Espresso, or lean modern with Coastal Gray or Kona.\n\nYou’ve also got options for eye-catching window frames, either color-matched to the wood-look finish, or in bold silver or black for contrast. Stack the windows vertically or run them along the top for a custom look. It’s a warm modern vibe, perfect for everything from a laid-back beach house to a bold mid-century or transitional design.\n\nIn a world of either-or, this garage door says “both.” Want curb appeal that stands out, but still feels like home? The Modern Steel™ Ultra-Grain® Plank is proof you can have welcoming character and modern minimalism in the same space. ",
    "images": ["", "", "", "", "", "", "", ""]
  },
  {
    "id": 10,
    "title": "Gallery® Steel",
    "description": "Inspired by old-school carriage houses, the Gallery® Steel garage door is a fresh take on an iconic classic. This door features beautifully grooved panels and a variety of window and color options that will impress all the neighbors. You can go traditional or contemporary with Ultra-Grain® wood-look finishes for warmth and sophistication or Lustra™ matte colors for a cool, modern edge.\n\nBuilt from tough, high-quality steel, the Gallery® door is designed for busy lives and doesn’t require a lot of upkeep. The insulation keeps things cozy in winter and cool in summer, and you’ll barely have to lift a finger to keep it looking sharp. No endless painting, no worrying about warping or cracking, just a door that works, lasts, and keeps your curb appeal dialed up. With the Gallery® Steel door, you get unending style that makes a strong first impression.",
    "images": ["", "", "", "", "", "", "", ""]
  },
  {
    "id": 11,
    "title": "Avante®",
    "description": "The Avante® is more than just an upgrade; it’s a stunning garage door designed to turn heads and leave a lasting impression. With its clean, minimalist lines and sleek aluminum frame, the Avante® creates a dramatic architectural presence for any space—garage, loft, solarium, or even as a creative indoor partition. You can customize glass and aluminum panels to control privacy, natural light, and achieve a look that reflects your style.\n\nLet daylight stream in with clear or frosted glass or select tinted and mirrored panels for added privacy. At night, the Avante® softly illuminates your space, bringing a modern edge to your home. Built with commercial-grade aluminum and Intellicore® insulation, it’s strong, energy efficient, quiet, and easy to maintain.",
    "images": ["", "", "", "", "", "", "", ""]
  },
  {
    "id": 12,
    "title": "VertiStack® Avante®",
    "description": "Give your home a serious style upgrade—and rethink how you use your garage—with the VertiStack® Avante® garage door. This isn’t your average overhead door. With its modern aluminum-and-glass design, the VertiStack® Avante® delivers a contemporary edge that sets your place apart. The real magic? Its panels stack vertically above the opening, so you get a wide, unobstructed entryway with no visible tracks, hinges, or cables crowding your space. The result is a streamlined look that takes your curb appeal up a notch.\n\nThis door isn’t just about looks, either. The VertiStack® Avante® earned the Best of IBS Best in Show award at the 2025 NAHB International Builders’ Show®, a nod to its standout design and innovation. Whether you’re entertaining friends or just unwinding, you’ll appreciate how it erases the boundary between indoors and out, letting in more light and fresh air. Built from tough, low-maintenance materials, this door delivers style and convenience in one sharp package, giving you a whole new way to enjoy your garage.",
    "images": ["", "", "", "", "", "", "", ""]
  },
  {
    "id": 13,
    "title": "Avante® Sleek",
    "description": "If you want a garage door that’s all about uninterrupted views and modern style, the Avante® Sleek is in a class of its own. The design puts wide, horizontal glass panels front and center, with barely-there vertical supports that maximize your sightlines and flood your garage with natural light. No chunky frames, no distractions—just a sleek, open feel that instantly upgrades your home’s curb appeal.\n\nWhat really sets the Avante® Sleek apart is how much you can make it your own. Choose from clear, tinted, mirrored, or obscure glass to control the amount of light and privacy you want. You can even add solid aluminum panels in the same color as the frame for a totally custom look. And with a range of finishes and hardware, it’s easy to find a combination that fits your style. If you’re ready for a garage door that’s as striking as it is practical, the Avante® Sleek is tough to beat.",
    "images": ["", "", "", "", "", "", "", ""]
  },
  {
    "id": 14,
    "title": "Coachman®",
    "description": "Open the door to timeless style and everyday ease with the Coachman® garage door, a modern twist on classic carriage house style. Each door blends the warmth and charm of a traditional swing-out look with the convenience of overhead operation. Underneath the beautiful, woodgrain-textured composite overlays, you’ll find tough, insulated steel that stands up to the elements and helps keep your garage comfortable year-round.\n\nBut it’s the details that set Coachman® doors apart: authentic design touches, low-maintenance materials, and a variety of colors and window options let you match your door to your personal taste and your home’s unique character. Best of all, Coachman® doors are built for real life—easy to operate, simple to care for, and designed to stay stunning for years to come.",
    "images": ["", "", "", "", "", "", "", ""]
  },
  {
    "id": 15,
    "title": "Grand Harbor®",
    "description": "Give your home a stylish upgrade without stretching your budget. The Grand Harbor® garage door brings together carriage house charm and standout curb appeal at an affordable price. Its clean lines and customizable design let you create a look that perfectly matches your style without the premium price tag.\n\nThe Grand Harbor® blends beauty with durability. Its sturdy steel frame and low-maintenance composite overlays offer the warmth of wood, but without the extra upkeep or cost. You can choose insulation options that fit your climate and comfort needs. Add black wrought iron-style hardware for eye-catching detail. Enjoy smooth, overhead operation every day with no heavy lifting and no headaches. Whether you want a fresh look, practical features, or both, Grand Harbor® delivers timeless style while keeping your costs in check.",
    "images": ["", "", "", "", "", "", "", ""]
  },
  {
    "id": 16,
    "title": "Classic™ Steel",
    "description": "Think a garage door is just a garage door? Our Classic™ Steel collection is here to prove otherwise. This is the door most people picture when they imagine a traditional garage—only stronger, smarter, and far more stylish than you’d expect. Built from top-tier steel that shrugs off wild weather and daily wear, Classic™ Steel delivers the kind of curb appeal that can completely change the look of your home.\n\nYou’ll find every option you could want; short or long raised panels, a spectrum of colors (including Ultra-Grain® finishes that look just like real wood), plus window designs that let you bring in natural light without sacrificing privacy. Insulation choices range from basic to industry-leading, so your garage stays comfortable, and your energy bills stay in check.\n\nBut it’s not just about looks or comfort. These doors are engineered for quiet, smooth operation and built to last for decades with almost no maintenance. If you want to make a stylish, lasting choice that adds value to your home, the Classic™ Steel garage door is the way to go.",
    "images": ["", "", "", "", "", "", "", ""]
  }
]
